HA_1C/Documents/РегистрацииТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>РегистрацииТО</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастерская</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеМастерские</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийНомерТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегламентнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеТОНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеТОПоПлану</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеТОПоФакту</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеТОСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееТОНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееТОПоПлану</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееТОПоФакту</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееТОСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееТОНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееТОПоПлану</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееТОПоФакту</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееТОСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрошлоеТОСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееТОСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующееТОСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HA_1C/InformationRegisters/ЗарегистрированныеТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЗарегистрированныеТО</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоФакту</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентнаяРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

HA_1C/Enums/СтатусыВыполненияТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыВыполненияТО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пройдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПройдено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

HA_1C/Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПриобретения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РегламентныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегламентнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интервал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HA_1C/Documents/РегистрацииТО/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтчетныеПоказатели() Экспорт
	
	ПланТО = ТаблицаПланТО(ТекущаяДата());
	
	ВидыТекущихТО = Новый Массив;
	ВидыТекущихТО.Добавить(ИмяПрошлогоТО());
	ВидыТекущихТО.Добавить(ИмяТекущееТО());
	
	НевыполненныеТО = 0;
	Для каждого СтрокаТО Из ПланТО Цикл
		Для каждого ВидТО Из ВидыТекущихТО Цикл
			Если Не ЗначениеЗаполнено(СтрокаТО[ВидТО + "ПоФакту"]) 
				И СтрокаТО[ВидТО + "Статус"] = Перечисления.СтатусыВыполненияТО.НеПройдено
				И СтрокаТО[ВидТО + "Номер"] > 0 Тогда
				НевыполненныеТО = НевыполненныеТО + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Показатели = Новый Соответствие;
	Показатели.Вставить(НСтр("ru = 'Невыполненные ТО:'; en = 'Not passed services:'"), НевыполненныеТО);
	
	Возврат Показатели;
	
КонецФункции

Функция ПолучитьВидыТО() Экспорт
	
	ВидыТО = Новый Массив;
	ВидыТО.Добавить(ИмяПрошлогоТО());
	ВидыТО.Добавить(ИмяТекущееТО());
	ВидыТО.Добавить(ИмяСледующееТО());
	
	Возврат ВидыТО;
	
КонецФункции

Функция ИмяПрошлогоТО() Экспорт
	
	Возврат "ПрошлоеТО";
	
КонецФункции

Функция ИмяТекущееТО() Экспорт
	
	Возврат "ТекущееТО";
	
КонецФункции

Функция ИмяСледующееТО() Экспорт
	
	Возврат "СледующееТО";
	
КонецФункции

Функция ТаблицаПланТО(ДатаАнализа, Автомобиль = Неопределено) Экспорт
	
	Проверки.СвойствоЗаполнено(ДатаАнализа);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.ТекущийНомерТО КАК НомерТОТекущий,
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.Интервал / 12 КАК ИнтервалВнутригодовой
	|ПОМЕСТИТЬ ВлЗапрос
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВлЗапрос.Интервал КАК Интервал,
	|		ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|		ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО КАК ЧИСЛО(13, 0))) = ВлЗапрос.ТекущийНомерТО
	|				ТОГДА ВлЗапрос.ТекущийНомерТО
	|			ИНАЧЕ ВЫРАЗИТЬ(ВлЗапрос.ТекущийНомерТО - 0.5 КАК ЧИСЛО(13, 0))
	|		КОНЕЦ КАК ТекущийНомерТО,
	|		ВлЗапрос.Автомобиль КАК Автомобиль
	|	ИЗ
	|		(ВЫБРАТЬ
	|			АвтомобилиРегламентныеРаботы.Интервал КАК Интервал,
	|			АвтомобилиРегламентныеРаботы.РегламентнаяРабота КАК РегламентнаяРабота,
	|			АвтомобилиРегламентныеРаботы.Ссылка.ДатаПриобретения КАК ДатаПриобретения,
	|			ВЫРАЗИТЬ(РАЗНОСТЬДАТ(АвтомобилиРегламентныеРаботы.Ссылка.ДатаПриобретения, &ДатаАнализа, МЕСЯЦ) / АвтомобилиРегламентныеРаботы.Интервал КАК ЧИСЛО(10, 3)) КАК ТекущийНомерТО,
	|			АвтомобилиРегламентныеРаботы.Ссылка КАК Автомобиль
	|		ИЗ
	|			Справочник.Автомобили.РегламентныеРаботы КАК АвтомобилиРегламентныеРаботы
	|		ГДЕ
	|			(&Автомобиль = НЕОПРЕДЕЛЕНО
	|					ИЛИ АвтомобилиРегламентныеРаботы.Ссылка = &Автомобиль)) КАК ВлЗапрос) КАК ВлЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.НомерТОТекущий КАК НомерТОТекущий,
	|	ВлЗапрос.ИнтервалВнутригодовой КАК ИнтервалВнутригодовой,
	|	0 КАК Поле1
	|ПОМЕСТИТЬ ТОВнутригодовой
	|ИЗ
	|	ВлЗапрос КАК ВлЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВлЗапрос.Интервал,
	|	ВлЗапрос.РегламентнаяРабота,
	|	ВлЗапрос.ДатаПриобретения,
	|	ВлЗапрос.Автомобиль,
	|	ВлЗапрос.НомерТОТекущий - 1,
	|	ВлЗапрос.ИнтервалВнутригодовой,
	|	1
	|ИЗ
	|	ВлЗапрос КАК ВлЗапрос
	|ГДЕ
	|	ВлЗапрос.ИнтервалВнутригодовой <> (ВЫРАЗИТЬ(ВлЗапрос.ИнтервалВнутригодовой КАК ЧИСЛО(13, 0)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлЗапрос.Автомобиль КАК Автомобиль,
	|	ВлЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВлЗапрос.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ВлЗапрос.Интервал КАК Интервал,
	|	ВлЗапрос.НомерТОТекущий - ВлЗапрос.ИнтервалВнутригодовой КАК НомерТОПрошлый,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВлЗапрос.ДатаПриобретения, &ДатаАнализа, МЕСЯЦ) < ВлЗапрос.Интервал
	|			ТОГДА NULL
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, (ВлЗапрос.НомерТОТекущий - 1) * ВлЗапрос.Интервал)
	|	КОНЕЦ КАК ПрошлоеТОПоПлану,
	|	ВлЗапрос.НомерТОТекущий КАК НомерТОТекущий,
	|	ВЫБОР
	|		КОГДА ВлЗапрос.НомерТОТекущий = 0
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, ВлЗапрос.Интервал)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, ВлЗапрос.НомерТОТекущий * ВлЗапрос.Интервал)
	|	КОНЕЦ КАК ТекущееТОПоПлану,
	|	ВлЗапрос.НомерТОТекущий + ВлЗапрос.ИнтервалВнутригодовой КАК НомерТОСледующий,
	|	ДОБАВИТЬКДАТЕ(ВлЗапрос.ДатаПриобретения, МЕСЯЦ, (ВлЗапрос.НомерТОТекущий + 1) * ВлЗапрос.Интервал) КАК СледующееТОПоПлану
	|ПОМЕСТИТЬ ТО_ПЛАН
	|ИЗ
	|	ТОВнутригодовой КАК ВлЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТО_ПЛАН.Автомобиль КАК Автомобиль,
	|	ТО_ПЛАН.РегламентнаяРабота КАК РегламентнаяРабота,
	|	ТО_ПЛАН.НомерТОПрошлый КАК ПрошлоеТОНомер,
	|	ТО_ПЛАН.ПрошлоеТОПоПлану КАК ПрошлоеТОПоПлану,
	|	ЗарегистрированныеТОПрошлые.ПоФакту КАК ПрошлоеТОПоФакту,
	|	ЕСТЬNULL(ЗарегистрированныеТОПрошлые.СтатусТО, ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.НеПройдено)) КАК ПрошлоеТОСтатус,
	|	ТО_ПЛАН.НомерТОТекущий КАК ТекущееТОНомер,
	|	ТО_ПЛАН.ТекущееТОПоПлану КАК ТекущееТОПоПлану,
	|	ЗарегистрированныеТОТекущие.ПоФакту КАК ТекущееТОПоФакту,
	|	ЕСТЬNULL(ЗарегистрированныеТОТекущие.СтатусТО, ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.НеПройдено)) КАК ТекущееТОСтатус,
	|	ТО_ПЛАН.НомерТОСледующий КАК СледующееТОНомер,
	|	ТО_ПЛАН.СледующееТОПоПлану КАК СледующееТОПоПлану,
	|	ЗарегистрированныеТОСледующие.ПоФакту КАК СледующееТОПоФакту,
	|	ЕСТЬNULL(ЗарегистрированныеТОСледующие.СтатусТО, ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТО.НеПройдено)) КАК СледующееТОСтатус,
	|	ЗарегистрированныеТОПрошлые.Сумма КАК ПрошлоеТОСумма,
	|	ЗарегистрированныеТОТекущие.Сумма КАК ТекущееТОСумма,
	|	ЗарегистрированныеТОСледующие.Сумма КАК СледующееТОСумма
	|ИЗ
	|	ТО_ПЛАН КАК ТО_ПЛАН
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ЗарегистрированныеТОТекущие
	|		ПО ТО_ПЛАН.РегламентнаяРабота = ЗарегистрированныеТОТекущие.РегламентнаяРабота
	|			И ТО_ПЛАН.НомерТОТекущий = ЗарегистрированныеТОТекущие.НомерТО
	|			И ТО_ПЛАН.Автомобиль = ЗарегистрированныеТОТекущие.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ЗарегистрированныеТОПрошлые
	|		ПО ТО_ПЛАН.Автомобиль = ЗарегистрированныеТОПрошлые.Автомобиль
	|			И ТО_ПЛАН.РегламентнаяРабота = ЗарегистрированныеТОПрошлые.РегламентнаяРабота
	|			И ТО_ПЛАН.НомерТОПрошлый = ЗарегистрированныеТОПрошлые.НомерТО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗарегистрированныеТО КАК ЗарегистрированныеТОСледующие
	|		ПО ТО_ПЛАН.Автомобиль = ЗарегистрированныеТОСледующие.Автомобиль
	|			И ТО_ПЛАН.РегламентнаяРабота = ЗарегистрированныеТОСледующие.РегламентнаяРабота
	|			И ТО_ПЛАН.НомерТОСледующий = ЗарегистрированныеТОСледующие.НомерТО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Автомобиль,
	|	РегламентнаяРабота,
	|	ТекущееТОНомер");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ДатаАнализа", ДатаАнализа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДатаТОПоИнтервалу(ДатаПриобретения, ВидТО, ДатаДокумента) Экспорт
	
	ДатаАнализа = Дата(Год(ДатаДокумента), Месяц(ДатаПриобретения), День(ДатаПриобретения));
	
	Если ВидТО = ИмяТекущееТО() Тогда
		Если ДатаДокумента > ДатаАнализа Тогда
			Возврат ДатаАнализа;
		Иначе
			Возврат НачалоГода(ДатаАнализа) - 1
		КонецЕсли;
	ИначеЕсли ВидТО = ИмяСледующееТО() Тогда
		СледующийГодДатаАнализа = ДобавитьМесяц(ДатаАнализа, 12);
		СледующийГодДатаДокумента = ДобавитьМесяц(ДатаДокумента, 12);
		Если СледующийГодДатаДокумента > СледующийГодДатаАнализа Тогда
			Возврат СледующийГодДатаАнализа;
		Иначе
			Возврат НачалоГода(СледующийГодДатаАнализа) - 1;
		КонецЕсли;
	ИначеЕсли ВидТО = ИмяПрошлогоТО() Тогда
		КонецПрошлыйГодДатаАнализа = ДобавитьМесяц(ДатаАнализа, -12);
		КонецПрошлыйГодДатаДокумента = ДобавитьМесяц(ДатаДокумента, -12);
		Если КонецПрошлыйГодДатаДокумента > КонецПрошлыйГодДатаАнализа Тогда
			Возврат КонецПрошлыйГодДатаАнализа;
		Иначе
			Возврат НачалоГода(КонецПрошлыйГодДатаАнализа) - 1;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение "Not implemented";
	
КонецФункции

#КонецОбласти
